Учет_кабельной_продукции/src/InformationRegisters/ДанныеЖурналовУчетаКП/ДанныеЖурналовУчетаКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЖурналовУчетаКП</name>
  <resources>
    <name>Изм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерНитки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаПомещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обозначение1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаКоординаты</name>
    <type>
      <types>CatalogRef.Координаты</types>
    </type>
  </resources>
  <resources>
    <name>КудаКоординаты</name>
    <type>
      <types>CatalogRef.Координаты</types>
    </type>
  </resources>
  <resources>
    <name>КудаПомещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КудаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обозначение2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаПроектная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусКабельнойЛинии</name>
    <type>
      <types>EnumRef.СтатусыКабельныхЛиний</types>
    </type>
  </resources>
  <resources>
    <name>МаркировкаКабеля</name>
    <type>
      <types>CatalogRef.МаркиКабели</types>
    </type>
  </resources>
  <dimensions>
    <name>ЖурналКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КабельнаяЛиния</name>
    <type>
      <types>CatalogRef.КабельныеЛинии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/CommonModules/ПроведениеСервер/Module.bsl
Процедура ЗаписатьНаборыЗаписей(ОбъектЗаписи) Экспорт
	
		
	
КонецПроцедуры

Функция ЕстьДублиКабельныеЛинии(КабельныеЛинии) Экспорт
	
	МассивКабельныеЛинии = КабельныеЛинии.ВыгрузитьКолонку("КабельнаяЛиния");
	
	Возврат МассивКабельныеЛинии.Количество() > 1;	
	
КонецФункции

Процедура ЗаписьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка = Неопределено, СтатусКабельнойЛинии = Неопределено, Изменить = Ложь) Экспорт  

	Если Изменить Тогда  
		Для Каждого ТекДанные Из КабельныеЛинии Цикл  
			МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекДанные);
			МенеджерЗаписи.ЖурналКабельнойПродукции = ?(Ссылка = Неопределено, ТекДанные.ЖурналУчетаКП, Ссылка); 
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.СтатусКабельнойЛинии = ?(СтатусКабельнойЛинии = Неопределено, ТекДанные.Статус, СтатусКабельнойЛинии);
				МенеджерЗаписи.Записать(); 
			КонецЕсли;
		КонецЦикла;			
	Иначе	
		УдалитьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка);	
		Для Каждого ТекДанные Из КабельныеЛинии Цикл  
			МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекДанные);
			МенеджерЗаписи.ЖурналКабельнойПродукции = ?(Ссылка = Неопределено, ТекДанные.ЖурналУчетаКП, Ссылка);   
			МенеджерЗаписи.СтатусКабельнойЛинии     = ?(СтатусКабельнойЛинии = Неопределено, ТекДанные.Статус, СтатусКабельнойЛинии);
			МенеджерЗаписи.Записать();
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка = Неопределено) Экспорт  
	
	Для Каждого УдаляемыйКабель Из КабельныеЛинии Цикл   
		МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КабельнаяЛиния           = УдаляемыйКабель.КабельнаяЛиния; 
		МенеджерЗаписи.ЖурналКабельнойПродукции = ?(Ссылка = Неопределено, УдаляемыйКабель.ЖурналУчетаКП, Ссылка);
		МенеджерЗаписи.Удалить();	
	КонецЦикла;
	
КонецПроцедуры
